backend/app/Models/CatalogueModel.php

SELECT *
FROM `catalogue`
---
    public function getAll()
    {
        return $this->findAll(); // or use find($id) if only one record

SELECT `catalogue`.`id`, `catalogue`.`category`, `catalogue`.`series_code`, `catalogue`.`design`, `catalogue`.`fabric_type`, `catalogue`.`remarks`
FROM `catalogue`
WHERE `catalogue`.`id` = 'PT-CPE-155'
SELECT `item`.`type`, `item`.`colour`, `item`.`image_path`
FROM `item`
WHERE `item`.`series_code` = 'CPE-155'
SELECT `size`.`type`, `size`.`price`
FROM `size`
WHERE `size`.`series_code` = 'CPE-155'
---
    public function getCatalogueWithItemAndSize($catalogueId)
    {
        // Query to get the catalogue data
        $catalogueQuery = $this->db->table('catalogue')
            ->select('catalogue.id, catalogue.category, catalogue.series_code, catalogue.design, catalogue.fabric_type, catalogue.remarks')
            ->where('catalogue.id', $catalogueId)
            ->get(); // Fetch the catalogue data

        // Check if catalogue exists
        $catalogueResult = $catalogueQuery->getRowArray();

        if (!$catalogueResult) {
            return null; // If catalogue not found, return null
        }

        // Query to get the associated items based on the catalogue series_code
        $itemsQuery = $this->db->table('item')
            ->select('item.type, item.colour, item.image_path')
            ->where('item.series_code', $catalogueResult['series_code'])
            ->get(); // Fetch all items related to this catalogue

        // Query to get the associated sizes based on the catalogue series_code
        $sizesQuery = $this->db->table('size')
            ->select('size.type, size.price')
            ->where('size.series_code', $catalogueResult['series_code'])
            ->get(); // Fetch all sizes related to this catalogue