backend/app/Models/SizeModel.php

DELETE FROM `size`
WHERE `series_code` = 'CPE-155'
---
    public function deleteBySeriesCode($series_code)
    {
        return $this->where('series_code', $series_code)->delete();