backend/app/Models/UserModel.php

    public function getUsingEmail($email){
        $user = $this->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1