backend/app/Controllers/Catalogue.php

    private function processUpdateOps($id, $data, $uploadedFiles) {
        $db = \Config\Database::connect();
        $db->transStart(); // Start the transaction
        $ret = null;

        // Step 1: Update the catalogue table
        $updateResult = $this->catalogueModel->update($id, $data);
---
UPDATE `catalogue` SET `category` = 'tshirt', `series_code` = 'CPE-155', `design` = 'PRINTED H/S T-SHIRT', `fabric_type` = 'PREMIUM COTTON MERCERISED', `remarks` = 'AVAILABLE IN - MASTERPACK OF ASSORTED PRINTS OF 6 PCS.'
WHERE `catalogue`.`id` IN ('PT-CPE-155')

    private function insertItemData($seriesCode,$colourData, $uploadedFiles) {
        $insertSuccessCount = 0;
        if (!empty($uploadedFiles) && is_array($uploadedFiles)) {
            foreach ($colourData as $index => $entries) {
                // Check if this color index has uploaded files
                if (!empty($uploadedFiles[$index]) && isset($uploadedFiles[$index][0]['image_path'])) {
                    $colourData[$index]['image'] = $uploadedFiles[$index][0]['image_path'];
                }
            }
        }
        // Now insert each color entry
        foreach ($colourData as $key => $entry) {
            $data = [
                'series_code' => $seriesCode,
                'type'  => $entry['colourID'] ?? null,
                'colour'  => $entry['colourName'] ?? null,
                'image_path'       => $entry['image'] ?? null,
                'created_at'  => date('Y-m-d H:i:s'),
            ];            // Insert into DB
            $inserted = $this->itemModel->insert($data);
---
INSERT INTO `item` (`series_code`, `type`, `colour`, `image_path`) VALUES ('CPE-155', 'A', 'Pear', 'D:\\xampp\\Mritunjay\\project-tyriod-dashboard\\backend\\writable\\uploads/1754842285_d8b8754381448c190889.png')

    private function insertSizeData($seriesCode,$sizeData) {
        $insertSuccessCount = 0;
        if (!empty($sizeData) && is_array($sizeData)) {
            foreach ($sizeData as $sizeEntry) {
                $sizeData = [
                    'series_code' => $seriesCode,
                    'type'        => $sizeEntry['sizeType'],
                    'price'       => $sizeEntry['sizePrice'],
                    'dateadded'   => date('Y-m-d H:i:s'),
                ];
                if ($this->sizeModel->insert($sizeData)) {
---
INSERT INTO `size` (`series_code`, `type`, `price`, `dateadded`) VALUES ('CPE-155', '1', '200.00', '2025-08-10 16:11:25')